config/cf/Documents/ИзменениеПоказателейОборудования.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<Document>
		<Properties>
			<Name>ИзменениеПоказателейОборудования</Name>
			<BasedOn>
				<xr:Item>Document.ИзменениеПоказателейОборудования</xr:Item>
				<xr:Item>Document.Поступление</xr:Item>
				<xr:Item>Document.ОкончаниеОбслуживания</xr:Item>
				<xr:Item>Document.Задание</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.ПоказателиОборудования</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.Организация</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.АвторДокумента</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаСоздания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АвторКорректировки</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.АвторДокумента</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаКорректировки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Основание</Name>
					<Type>
						<v8:TypeSet>cfg:DocumentRef</v8:TypeSet>
						<v8:TypeSet>cfg:CatalogRef</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидЗначения</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидЗначенияПоказателяОборудования</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПоложениеВидаЗначения</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ПоложениеРеквизитаНаФорме</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Подразделения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПоложениеДаты</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ПоложениеРеквизитаНаФорме</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Показатели</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ДатаИзменения</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>DateTime</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КарточкаНоменклатуры</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.КарточкиНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидПоказателя</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВидыПоказателейОборудования</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидЗначения</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ВидЗначенияПоказателяОборудования</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Описание</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПрошлоеЗначение</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>АналитикаПоказателя</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.АналитикаИзмененияПоказателей</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИнициаторИзменения</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ИнициаторИзмененияПоказателей</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

config/cf/AccumulationRegisters/ПоказателиОборудования.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<AccumulationRegister>
		<Properties>
			<Name>ПоказателиОборудования</Name>
			<RegisterType>Turnovers</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Значение</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Описание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>КарточкаНоменклатуры</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КарточкиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидПоказателя</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыПоказателейОборудования</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>АналитикаПоказателя</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.АналитикаИзмененияПоказателей</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ИнициаторИзменения</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ИнициаторИзмененияПоказателей</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

config/cf/Enums/ПоложениеРеквизитаНаФорме.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<Enum>
		<Properties>
			<Name>ПоложениеРеквизитаНаФорме</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ВШапке</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВТабличнойЧасти</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

config/cf/Enums/ВидЗначенияПоказателяОборудования.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<Enum>
		<Properties>
			<Name>ВидЗначенияПоказателяОборудования</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ТекущееЗначениеПоказателя</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УвеличениеПоказателяНаЗначение</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

config/cf/Documents/ИзменениеПоказателейОборудования/Ext/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Если ПоложениеВидаЗначения = Перечисления.ПоложениеРеквизитаНаФорме.ВШапке Тогда
		Для каждого Строки Из Показатели Цикл
			Строки.ВидЗначения = ВидЗначения;
		КонецЦикла;
	КонецЕсли;	
	
	Если ПоложениеДаты = Перечисления.ПоложениеРеквизитаНаФорме.ВШапке ИЛИ НЕ ЗначениеЗаполнено(ПоложениеДаты) Тогда
		Для каждого Строки Из Показатели Цикл
			Если Строки.ДатаИзменения = Дата(1, 1, 1) Тогда
				Строки.ДатаИзменения = Дата;
			КонецЕсли;
		КонецЦикла;
	Иначе
		Дата = ТекущаяДатаСеанса();
	КонецЕсли;	
	
КонецПроцедуры

// Процедура - обработчик события ОбработкаПроверкиЗаполнения объекта.
//
Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	Ошибки = Неопределено;
	
	Для каждого Строки Из Показатели Цикл
		Если НЕ Строки.Номенклатура.ВидНоменклатуры.ВестиУчетПоКарточкамНоменклатуры Тогда
			ОбщегоНазначенияКлиентСервер.ДобавитьОшибкуПользователю(Ошибки, 
				"Объект.Показатели", 
				СтрШаблон(НСтр("ru = 'Номенклатура %1 не может иметь показателей, т.к. по ней не ведется учет по карточкам'"), Строки.Номенклатура),
				"",
				Строки.НомерСтроки);
		КонецЕсли;
	КонецЦикла;
	
	ОбщегоНазначенияКлиентСервер.СообщитьОшибкиПользователю(Ошибки, Отказ);
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
	Если ДанныеЗаполнения = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Основание					= ДанныеЗаполнения;
	МассивКарточекНоменклатуры 	= Новый Массив;
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ИзменениеПоказателейОборудования") Тогда
		
		МассивКарточекНоменклатуры	= ДанныеЗаполнения.Показатели.Выгрузить().ВыгрузитьКолонку("КарточкаНоменклатуры");
		
		ВидЗначения					= ДанныеЗаполнения.ВидЗначения;	
		Если Не ЗначениеЗаполнено(ВидЗначения) Тогда
			
			ВидЗначения = УправлениеITОтделом8УФПовтИсп.ПолучитьЗначениеНастройки("ВидЗначенияИзменениеПоказателейОборудования");
			Если НЕ ЗначениеЗаполнено(ВидЗначения) Тогда
				ВидЗначения = Перечисления.ВидЗначенияПоказателяОборудования.УвеличениеПоказателяНаЗначение;
			КонецЕсли;
			
		КонецЕсли;
		
	ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.Поступление") Тогда
		
		Если Не ЗначениеЗаполнено(ВидЗначения) Тогда
			
			ВидЗначения = УправлениеITОтделом8УФПовтИсп.ПолучитьЗначениеНастройки("ВидЗначенияИзменениеПоказателейОборудования");
			Если НЕ ЗначениеЗаполнено(ВидЗначения) Тогда
				ВидЗначения = Перечисления.ВидЗначенияПоказателяОборудования.УвеличениеПоказателяНаЗначение;
			КонецЕсли;
			
		КонецЕсли;
		
		Для Каждого Строки Из ДанныеЗаполнения.Номенклатура Цикл
			Если УправлениеITОтделом8УФПовтИсп.ВестиУчетПоКарточкамНоменклатуры(Строки.Номенклатура) Тогда
				МассивКарточекНоменклатуры.Добавить(Строки.КарточкаНоменклатуры);
			КонецЕсли;
		КонецЦикла;
		
	ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.Задание") Тогда
		
		Организация			= ДанныеЗаполнения.Организация;
		Комментарий			= ДанныеЗаполнения.Тема;
		МассивКарточекНоменклатуры.Добавить(ДанныеЗаполнения.КарточкаНоменклатуры);
		
		Если Не ЗначениеЗаполнено(ВидЗначения) Тогда
			
			ВидЗначения = УправлениеITОтделом8УФПовтИсп.ПолучитьЗначениеНастройки("ВидЗначенияИзменениеПоказателейОборудования");
			Если НЕ ЗначениеЗаполнено(ВидЗначения) Тогда
				ВидЗначения = Перечисления.ВидЗначенияПоказателяОборудования.УвеличениеПоказателяНаЗначение;
			КонецЕсли;
			
		КонецЕсли;
		
	ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ОкончаниеОбслуживания") Тогда
		
		Организация			= ДанныеЗаполнения.Организация;
		ПоложениеВидаЗначения = Перечисления.ПоложениеРеквизитаНаФорме.ВШапке;
		
		Если Не ЗначениеЗаполнено(ВидЗначения) Тогда
			
			ВидЗначения = УправлениеITОтделом8УФПовтИсп.ПолучитьЗначениеНастройки("ВидЗначенияИзменениеПоказателейОборудования");
			Если НЕ ЗначениеЗаполнено(ВидЗначения) Тогда
				ВидЗначения = Перечисления.ВидЗначенияПоказателяОборудования.УвеличениеПоказателяНаЗначение;
			КонецЕсли;
			
		КонецЕсли;
		
		Для Каждого Строки Из ДанныеЗаполнения.Номенклатура Цикл
			Если УправлениеITОтделом8УФПовтИсп.ВестиУчетПоКарточкамНоменклатуры(Строки.Номенклатура) Тогда
				МассивКарточекНоменклатуры.Добавить(Строки.КарточкаНоменклатуры);
			КонецЕсли;
		КонецЦикла;
		
	КонецЕсли;
	
	Если МассивКарточекНоменклатуры.Количество() > 0 Тогда
		
		Запрос = Новый Запрос();
		Запрос.Текст =
			"ВЫБРАТЬ
			|	ПоказателиОборудованияОбороты.ВидПоказателя,
			|	ПоказателиОборудованияОбороты.КарточкаНоменклатуры.Владелец КАК Номенклатура,
			|	ПоказателиОборудованияОбороты.КарточкаНоменклатуры,
			|	ПоказателиОборудованияОбороты.ЗначениеОборот КАК ПрошлоеЗначение,
			|	0 КАК Значение,
			|	&ВидЗначения
			|ИЗ
			|	РегистрНакопления.ПоказателиОборудования.Обороты(, , , КарточкаНоменклатуры В (&МассивКарточекНоменклатуры)) КАК ПоказателиОборудованияОбороты";
			
		Запрос.УстановитьПараметр("МассивКарточекНоменклатуры", МассивКарточекНоменклатуры);
		Запрос.УстановитьПараметр("ВидЗначения", ВидЗначения);
		Выборка = Запрос.Выполнить().Выбрать();
		Пока Выборка.Следующий() Цикл
			НоваяСтрока = Показатели.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, Выборка);
		КонецЦикла;
		
		// Пройдемся по тем, которых нет в регистре.
		Для Каждого Элемент Из МассивКарточекНоменклатуры Цикл
			
			// Не найдено, добавим.
			Если Показатели.Найти(Элемент, "КарточкаНоменклатуры") = Неопределено И ЗначениеЗаполнено(Элемент) Тогда
				
				НоваяСтрока 						= Показатели.Добавить();
				НоваяСтрока.Номенклатура 			= Элемент.Владелец;
				НоваяСтрока.КарточкаНоменклатуры 	= Элемент;				
				
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
		
	// Инициализация дополнительных свойств для проведения документа.
	УправлениеITОтделом8УФ.ИнициализироватьДополнительныеСвойстваДляПроведения(Ссылка, ДополнительныеСвойства);
	
	// Инициализация данных документа.
	СЛС.ИнициализироватьДанныеДокумента(Ссылка, ДополнительныеСвойства);
	
	// Подготовка наборов записей.
	УправлениеITОтделом8УФ.ПодготовитьНаборыЗаписейКРегистрацииДвижений(ЭтотОбъект);
	
	// Отражение в разделах учета.
	СЛС.ОтразитьДвиженияВРазделахУчета(Ссылка, ДополнительныеСвойства, Движения, Отказ);	
	
	// Запись наборов записей.
	УправлениеITОтделом8УФ.ЗаписатьНаборыЗаписей(ЭтотОбъект);	
	
	ДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц.Закрыть();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции	

// Процедура заполняет значения показателей по Карточке номенклатуры и виду показателя.
//
// Параметры:
// 	ТЧ 					- Табличная часть документа.
//  СвернутьПоказатели  - Булево - Определяет, требуется ли сворачивать табличную часть.
//
Процедура ЗаполнитьЗначенияПоказателейТабличнойЧасти(ТЧ, СвернутьПоказатели = Ложь) Экспорт
	
	Если СвернутьПоказатели Тогда
		ТЧ.Свернуть("КарточкаНоменклатуры,ВидПоказателя", "Значение");
	КонецЕсли;
	
	Запрос = Новый Запрос();
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ПоказателиОборудованияОбороты.КарточкаНоменклатуры,
		|	ПоказателиОборудованияОбороты.ВидПоказателя,
		|	ПоказателиОборудованияОбороты.ЗначениеОборот КАК Значение
		|ИЗ
		|	РегистрНакопления.ПоказателиОборудования.Обороты КАК ПоказателиОборудованияОбороты
		|ГДЕ
		|	ПоказателиОборудованияОбороты.КарточкаНоменклатуры В(&СписокКарточкаНоменклатуры)
		|	И ПоказателиОборудованияОбороты.ВидПоказателя В(&ВидыПоказателей)";
	
	Запрос.УстановитьПараметр("СписокКарточкаНоменклатуры", ТЧ.ВыгрузитьКолонку("КарточкаНоменклатуры"));
	Запрос.УстановитьПараметр("ВидыПоказателей", ТЧ.ВыгрузитьКолонку("ВидПоказателя"));
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Для Каждого Строки Из ТЧ Цикл
			Если Строки.КарточкаНоменклатуры = Выборка.КарточкаНоменклатуры И Строки.ВидПоказателя = Выборка.ВидПоказателя Тогда
				Строки.Значение = Выборка.Значение;
				Прервать;
			КонецЕсли;
		КонецЦикла;		
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
